# ============================================================
# Common - Taps
# ============================================================
tap "anomalyco/tap"

# ============================================================
# Common - Rust-based tools
# ============================================================
brew "atac"         # API client for the terminal
brew "bandwhich"    # bandwidth utilization monitor
brew "bat"          # cat clone with syntax highlighting
brew "btm"          # system monitor (bottom)
brew "delta"        # git diff viewer
brew "dog"          # DNS client (dig alternative)
brew "dust"         # intuitive disk usage (du alternative)
brew "eza"          # modern ls replacement
brew "fd"           # simple, fast find alternative
brew "gitui"        # terminal UI for git (Rust)
brew "gping"        # ping with a graph
brew "hyperfine"    # command-line benchmarking
brew "procs"        # modern ps replacement
brew "ripgrep"      # fast recursive grep
brew "sd"           # intuitive find & replace (sed alternative)
brew "starship"     # cross-shell prompt
brew "tealdeer"     # fast tldr client
brew "tokei"        # code statistics
brew "uv"           # fast Python package manager
brew "zellij"       # terminal multiplexer
brew "zoxide"       # smarter cd command

# ============================================================
# Common - Go-based tools
# ============================================================
brew "anomalyco/tap/opencode" # terminal AI coding tool
brew "ctop"                   # container metrics viewer
brew "fzf"                    # fuzzy finder
brew "dive"                   # Docker image layer explorer
brew "gh"                     # GitHub CLI
brew "glab"                   # GitLab CLI
brew "helm"                   # Kubernetes package manager
brew "krew"                   # kubectl plugin manager
brew "kubernetes-cli"         # kubectl
brew "lazydocker"             # terminal UI for Docker
brew "lazygit"                # terminal UI for git
brew "nats-server"            # NATS messaging server

# ============================================================
# Common - Others
# ============================================================
brew "awscli"
brew "blake3"
brew "cmake"
brew "glib"
brew "harfbuzz"
brew "htop"
brew "httpie"
brew "libtiff"
brew "llvm"
brew "minicom"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "maven"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "tree"
brew "unbound"
brew "wget"

# ============================================================
# macOS only
# ============================================================
if OS.mac?
  tap "homebrew/cask-fonts"

  # Casks - Fonts
  cask "font-jetbrains-mono-nerd-font"

  # Casks - Applications
  cask "claude-code"
  cask "ghostty"
  cask "kitty"
  cask "zed"
end

# ============================================================
# Linux only
# ============================================================
# if OS.linux?
# end

